{
   "book": "1 Timothy",
   "chapter": 3,
   "outline" : [
      {
         "text": "Critical times in the last days",
         "start": 1,
         "end": 7,
         "subtext": []
      },
      {
         "text": "Follow Paul's example closely",
         "start": 8,
         "end": 13,
         "subtext": []
      },
      {
         "text": "Continue in the things that you learned",
         "start": 14,
         "end": 17,
         "subtext": [
            {
               "text": "All Scripture inspired of God",
               "start": 16,
               "end": 16
            }
         ]
      }
   ],
   "verses": [
      {
         "num": 1,
         "text": "But know this, that in the last days critical times hard to deal with will be here."
      },
      {
         "num": 2,
         "text": "For men will be lovers of themselves, lovers of money, boastful, haughty, blasphemers, disobedient to parents, unthankful, disloyal,"
      },
      {
         "num": 3,
         "text": "having no natural affection, not open to any agreement, slanderers, without self-control, fierce, without love of goodness,"
      },
      {
         "num": 4,
         "text": "betrayers, headstrong, puffed up with pride, lovers of pleasures rather than lovers of God,"
      },
      {
         "num": 5,
         "text": "having an appearance of godliness but proving false to its power; and from these turn away."
      },
      {
         "num": 6,
         "text": "From among these arise men who slyly work their way into households and captivate weak women loaded down with sins, led by various desires,"
      },
      {
         "num": 7,
         "text": "always learning and yet never able to come to an accurate knowledge of truth."
      },
      {
         "num": 8,
         "text": "Now in the way that Jan'nes and Jam'bres opposed Moses, so these also go on opposing the truth. Such men are completely corrupted in mind, disapproved as regards the faith."
      },
      {
         "num": 9,
         "text": "Nevertheless, they will make no further progress, for their folly* will be very plain to all, as it was with those two men."
      },
      {
         "num": 10,
         "text": "But you have closely followed my teaching, my course of life, my purpose, my faith, my patience, my love, my endurance,"
      },
      {
         "num": 11,
         "text": "the persecutions and sufferings such as I experienced in Antioch, in Ico'nium, in Lys'tra. I endured these persecutions, and the Lord rescued me from them all."
      },
      {
         "num": 12,
         "text": "In fact, all those desiring to live with godly devotion in association with Christ Jesus will also be persecuted."
      },
      {
         "num": 13,
         "text": "But wicked men and impostors will advance from bad to worse, misleading and being misled."
      },
      {
         "num": 14,
         "text": "You, however, continue in the things that you learned and were persuaded to believe, knowing from whom you learned them"
      },
      {
         "num": 15,
         "text": "and that from infancy you have known the holy writings, which are able to make you wise for salvation through faith in Christ Jesus."
      },
      {
         "num": 16,
         "text": "All Scripture is inspired of God and beneficial for teaching, for reproving, for setting things straight,* for disciplining in righteousness,"
      },
      {
         "num": 17,
         "text": "so that the man of God may be fully competent, completely equipped for every good work."
      }
   ]
}